benchmark/patch_64k_result.txt
Summary:
  Success rate:	99.45%
  Total:	60.0128 sec
  Slowest:	7.8052 sec
  Fastest:	0.3186 sec
  Average:	2.8636 sec
  Requests/sec:	142.4363

  Total data:	506.44 MiB
  Size/request:	64.00 KiB
  Size/sec:	8.44 MiB

Response time histogram:
  0.319 sec [1]    |
  1.067 sec [335]  |■■■■
  1.816 sec [760]  |■■■■■■■■■
  2.565 sec [2019] |■■■■■■■■■■■■■■■■■■■■■■■■■
  3.313 sec [2510] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.062 sec [1630] |■■■■■■■■■■■■■■■■■■■■
  4.811 sec [546]  |■■■■■■
  5.559 sec [232]  |■■
  6.308 sec [49]   |
  7.057 sec [17]   |
  7.805 sec [4]    |

Response time distribution:
  10.00% in 1.5878 sec
  25.00% in 2.2053 sec
  50.00% in 2.8264 sec
  75.00% in 3.4820 sec
  90.00% in 4.0949 sec
  95.00% in 4.6579 sec
  99.00% in 5.4978 sec
  99.90% in 6.7687 sec
  99.99% in 7.8052 sec


Details (average, fastest, slowest):
  DNS+dialup:	0.0379 sec, 0.0033 sec, 0.0612 sec
  DNS-lookup:	0.0000 sec, 0.0000 sec, 0.0006 sec

Status code distribution:
  [200] 8103 responses

Error distribution:
  [400] aborted due to deadline
  [45] connection error